---
kind: method
id: M:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.#ctor(Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves)
source: html/0f45daa6-920a-f09f-2675-ada06b274def.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.#ctor Method

Creates a copy of the ClosestPointsPairBetweenTwoCurves.

## Syntax (C#)
```csharp
public ClosestPointsPairBetweenTwoCurves(
	ClosestPointsPairBetweenTwoCurves other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null